In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
d = {"collage":[1,2,3,4,5],"university":[6,7,8,9,10]}

In [6]:
df = pd.DataFrame(d)

In [7]:
df

   collage  university
0        1           6
1        2           7
2        3           8
3        4           9
4        5          10

In [8]:
print(df)

   collage  university
0        1           6
1        2           7
2        3           8
3        4           9
4        5          10

In [9]:
arr2d = np.arange(30).reshape(6,5)

In [10]:
arr2d

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24],
       [25, 26, 27, 28, 29]])

In [11]:
df = pd.DataFrame(arr2d,columns=["A","B","C","D","E"],index=["P","Q","R","S","T","U"])

In [12]:
df

    A   B   C   D   E
P   0   1   2   3   4
Q   5   6   7   8   9
R  10  11  12  13  14
S  15  16  17  18  19
T  20  21  22  23  24
U  25  26  27  28  29

In [13]:
# Methods of fetching a column

In [14]:
df["A"]

P     0
Q     5
R    10
S    15
T    20
U    25
Name: A, dtype: int32

In [15]:
type(df["A"])

pandas.core.series.Series

In [16]:
df.B

P     1
Q     6
R    11
S    16
T    21
U    26
Name: B, dtype: int32

In [17]:
# Methods of fetching a row

In [18]:
df.loc["Q"]

A    5
B    6
C    7
D    8
E    9
Name: Q, dtype: int32

In [19]:
df.loc["U"]

A    25
B    26
C    27
D    28
E    29
Name: U, dtype: int32

In [20]:
df.iloc[0]

A    0
B    1
C    2
D    3
E    4
Name: P, dtype: int32

In [21]:
df.iloc[5]

A    25
B    26
C    27
D    28
E    29
Name: U, dtype: int32

In [22]:
df.B.P

1

In [23]:
df["B"]["P"]

1

In [24]:
df.loc["P"]["B"]

1

In [25]:
df.loc["P"].B

1

In [26]:
df.iloc[0].B

1

# Modifications in the dataframe

In [27]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [28]:
df.index

Index(['P', 'Q', 'R', 'S', 'T', 'U'], dtype='object')

In [29]:
df.iloc[5] = 100

In [30]:
df

     A    B    C    D    E
P    0    1    2    3    4
Q    5    6    7    8    9
R   10   11   12   13   14
S   15   16   17   18   19
T   20   21   22   23   24
U  100  100  100  100  100

In [31]:
df.iloc[0].B = 50

In [32]:
df

     A    B    C    D    E
P    0   50    2    3    4
Q    5    6    7    8    9
R   10   11   12   13   14
S   15   16   17   18   19
T   20   21   22   23   24
U  100  100  100  100  100

In [33]:
df.iloc[1] = [10,20,30,40,50]

In [34]:
df

     A    B    C    D    E
P    0   50    2    3    4
Q   10   20   30   40   50
R   10   11   12   13   14
S   15   16   17   18   19
T   20   21   22   23   24
U  100  100  100  100  100

In [35]:
df.drop("C",axis=1,inplace=False)

     A    B    D    E
P    0   50    3    4
Q   10   20   40   50
R   10   11   13   14
S   15   16   18   19
T   20   21   23   24
U  100  100  100  100

In [36]:
df

     A    B    C    D    E
P    0   50    2    3    4
Q   10   20   30   40   50
R   10   11   12   13   14
S   15   16   17   18   19
T   20   21   22   23   24
U  100  100  100  100  100

In [37]:
df.drop("C",axis=1,inplace=True)

In [38]:
df

     A    B    D    E
P    0   50    3    4
Q   10   20   40   50
R   10   11   13   14
S   15   16   18   19
T   20   21   23   24
U  100  100  100  100

In [39]:
df.drop("P",axis=0,inplace=True)

In [40]:
df

     A    B    D    E
Q   10   20   40   50
R   10   11   13   14
S   15   16   18   19
T   20   21   23   24
U  100  100  100  100

In [42]:
df.shape

(5, 4)

# Adding new rows & columns...

In [47]:
df["F"] = [7,5,3,1,4] # To add a column...

In [48]:
df

     A    B    D    E  F
Q   10   20   40   50  7
R   10   11   13   14  5
S   15   16   18   19  3
T   20   21   23   24  1
U  100  100  100  100  4

In [49]:
df.loc["V"] = 20

In [50]:
df

     A    B    D    E   F
Q   10   20   40   50   7
R   10   11   13   14   5
S   15   16   18   19   3
T   20   21   23   24   1
U  100  100  100  100   4
V   20   20   20   20  20

In [51]:
df.sort_index()

     A    B    D    E   F
Q   10   20   40   50   7
R   10   11   13   14   5
S   15   16   18   19   3
T   20   21   23   24   1
U  100  100  100  100   4
V   20   20   20   20  20

In [56]:
df.sort_values(by="B")

     A    B    D    E   F
R   10   11   13   14   5
S   15   16   18   19   3
Q   10   20   40   50   7
V   20   20   20   20  20
T   20   21   23   24   1
U  100  100  100  100   4

In [57]:
df

     A    B    D    E   F
Q   10   20   40   50   7
R   10   11   13   14   5
S   15   16   18   19   3
T   20   21   23   24   1
U  100  100  100  100   4
V   20   20   20   20  20

In [58]:
df.reset_index()

  index    A    B    D    E   F
0     Q   10   20   40   50   7
1     R   10   11   13   14   5
2     S   15   16   18   19   3
3     T   20   21   23   24   1
4     U  100  100  100  100   4
5     V   20   20   20   20  20

In [60]:
df.reset_index(drop=True,inplace=True)

In [61]:
df

     A    B    D    E   F
0   10   20   40   50   7
1   10   11   13   14   5
2   15   16   18   19   3
3   20   21   23   24   1
4  100  100  100  100   4
5   20   20   20   20  20